from emulators.pascal import PascalineEmulator

config = [
    {
        "id": 1,
        "year": 1642,
        "title": "Паскаліна",
        "era": "Епоха механічних обчислювачів",
        "description": "Паскаліна - це механічний обчислювальний апарат, створений французьким математиком Блезом Паскалем в 1642 для допомоги своєму батькові в рутинних арифметичних розрахунках. Ця перша арифмометра вміла виконувати додавання і віднімання за допомогою обертових дисків і зубчастих коліс, подібно до одометра автомобіля. Паскаліна стала важливим кроком в історії обчислювальних пристроїв та предтечею сучасних калькуляторів. Ключові факти про Паскаліну: " 
        "\nВинахідник: Блез Паскаль. " 
        "\nРік створення: 1642 рік. " 
        "\nПризначення: Допомога батькові Паскаля у розрахунку податків та інших арифметичних обчислень." 
        "\nПринцип роботи: Числа вводяться шляхом маніпулювання дисками, а операція виконується обертанням коліс." 
        "\nМожливості: Виконувала тільки операції складання та віднімання. \n" 
        "Значення: Перша машина для виконання арифметичних операцій, що започаткувала еру механічних калькуляторів.",
        "tasks": [
            {"id": 1, "text": "Порахуй 256+128",  "answer_id": {384:1}},
            {"id": 2, "text": "Порахуй 999+1",  "answer_id": {1000:2}}
        ],
        "emulator": PascalineEmulator
    },
    {
        "id": 2,
        "year": 1820,
        "title": "Аріфмометр",
        "era": "Епоха механічних обчислювачів",
        "description": "Більш складний калькулятор, здатний множити...",
        "tasks": [
            {"id": 1, "text": "Помножь 47×13", "answer_id" : {611:1}},
            {"id": 2, "text": "Поділи 144÷12",  "answer_id": {12:2}}
        ],
        "emulator": None
    },
    {
        "id": 3,
        "year": 1820,
        "title": "gdfgdsfh",
        "era": "gdfsgdsfgsdfg ",
        "description": "sdgfdsg...",
        "tasks": [
            {"id": 1, "text": "...", },
            {"id": 2, "text": "...", }
        ],
        "emulator": None
    },
    
    
]
